Tekla Open API Reference for Tekla Structures 2025
AnalysisCurvature Properties
The AnalysisCurvature type exposes the following members.
Properties
Name | Description
Radius
 The radius of the beam curvature.
RadiusDirection
 The radius direction of the beam curvature.
Top
See Also
Reference
AnalysisCurvature Class
Tekla.Structures.Analysis Namespace